ДемоПримерыОбменов/src/Catalogs/Файлы/Файлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Файлы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДвоичныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ДемоПримерыОбменов/src/Catalogs/Файлы/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Если Копирование Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		Отказ = Истина;
		НачатьДобавлениеФайла(Родитель);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	СкачатьФайл(ВыбраннаяСтрока);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СкачатьВсе(Команда)

	АдресАрхива = ПодготовитьАрхив();
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов;
	ПолучитьФайлССервераАсинх(АдресАрхива, "export.zip", ПараметрыДиалога);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Асинх Процедура НачатьДобавлениеФайла(Родитель)
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок = "Выберите файл для загрузки";
	
	ОповещениеПередНачалом = Новый ОписаниеОповещения("ПередНачаломЗагрузкиФайла", ЭтотОбъект);
	
	Результат = Ждать ПоместитьФайлНаСерверАсинх(, ОповещениеПередНачалом,, ПараметрыДиалога);
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.ПомещениеФайлаОтменено Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаФайл = Результат.СсылкаНаФайл;
	
	Размер = СсылкаНаФайл.Размер();
	Имя = СсылкаНаФайл.Имя;
	Расширение = СсылкаНаФайл.Расширение;
	
	Ссылка = СохранитьВСправочник(Результат.Адрес, Имя, Расширение, Размер, Родитель);
	
	ОповеститьОбИзменении(Ссылка);
	
	ПоказатьОповещениеПользователя("Файл сохранен", 
		ПолучитьНавигационнуюСсылку(Ссылка),
		Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередНачаломЗагрузкиФайла(ПомещаемыйФайл, ОтказОтПомещенияФайла, ДополнительныеПараметры) Экспорт

	Если ПомещаемыйФайл.Размер() > 10000000 Тогда
		ОтказОтПомещенияФайла = Истина;
		ПредупреждениеАсинх("Размер файла должен быть меньше 10 МБ");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Асинх Процедура СкачатьФайл(Ссылка)
		
	ДанныеФайла = ДанныеФайла(Ссылка);
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов;
	ПолучитьФайлССервераАсинх(ДанныеФайла.Адрес, ДанныеФайла.Имя, ПараметрыДиалога);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеФайла(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Файлы.Наименование КАК Наименование,
		|	Файлы.Расширение КАК Расширение,
		|	Файлы.ДвоичныеДанные КАК ДвоичныеДанные
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|ГДЕ
		|	Файлы.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	ДвоичныеДанные = Выборка.ДвоичныеДанные.Получить();
	
	Результат = Новый Структура;
	Результат.Вставить("Имя", Выборка.Наименование);
	Результат.Вставить("Расширение", Выборка.Расширение);
	Результат.Вставить("Адрес", ПоместитьВоВременноеХранилище(ДвоичныеДанные));
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция СохранитьВСправочник(АдресФайла, Имя, Расширение, Размер, Родитель)
	
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайла);
	
	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеширование.Добавить(ДанныеФайла);
	
	ХешСумма = Base64Строка(Хеширование.ХешСумма);
	
	СпрОбъект = Справочники.Файлы.СоздатьЭлемент();
	СпрОбъект.Наименование = Имя;
	СпрОбъект.Расширение = Расширение;
	СпрОбъект.РазмерФайла = Размер;
	СпрОбъект.ХешСумма = ХешСумма;
	СпрОбъект.Родитель = Родитель;
	СпрОбъект.ДвоичныеДанные = Новый ХранилищеЗначения(ДанныеФайла);
	
	СпрОбъект.Записать();
	
	Возврат СпрОбъект.Ссылка;
	
КонецФункции

&НаСервере
Функция ПодготовитьАрхив()
	
	Поток = Новый ПотокВПамяти;
	
	ЗаписьАрхива = Новый ЗаписьФайлаАрхива(Поток);
	
	ИмяВременногоКаталога = ПолучитьИмяВременногоФайла("");
	СоздатьКаталог(ИмяВременногоКаталога);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Файлы.Ссылка КАК Ссылка,
		|	Файлы.ЭтоГруппа КАК ЭтоГруппа,
		|	Файлы.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|ГДЕ
		|	НЕ Файлы.ЭтоГруппа
		|ИТОГИ
		|ПО
		|	Ссылка ТОЛЬКО ИЕРАРХИЯ";
		
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	СохранитьФайлыВыборки(Выборка, ИмяВременногоКаталога);
		
	ЗаписьАрхива.Добавить(ИмяВременногоКаталога + "/*.*", 
		РежимСохраненияПутейФайлаАрхива.СохранятьОтносительныеПути,
		РежимОбработкиПодкаталоговФайлаАрхива.ОбрабатыватьРекурсивно);
		
	ЗаписьАрхива.Записать();
	
	//@skip-check empty-except-statement - не обрабатываем ошибку удаления файла
	Попытка
		УдалитьФайлы(ИмяВременногоКаталога);
	Исключение
		// Ошибка при удалении файла
	КонецПопытки;
	
	ДвоичныеДанные = Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
КонецФункции

&НаСервере
//@skip-check query-in-loop - двоичные данные получаем по необходимости
Процедура СохранитьФайлыВыборки(Выборка, ИмяВременногоКаталога)
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			ВложеннаяВыборка = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			СохранитьФайлыВыборки(ВложеннаяВыборка, ИмяВременногоКаталога);
			Продолжить;
		КонецЕсли;			
		
		Если Выборка.ЭтоГруппа Тогда
			ИмяВложенногоКаталога = ИмяВременногоКаталога + ПолучитьРазделительПути() + Выборка.Наименование;
			Если Выборка.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоИерархии Тогда
				ВложеннаяВыборка = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "Ссылка");
			Иначе
				ВложеннаяВыборка = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			КонецЕсли;	
			СоздатьКаталог(ИмяВложенногоКаталога);
			СохранитьФайлыВыборки(ВложеннаяВыборка, ИмяВложенногоКаталога);
		Иначе
			ДвоичныеДанные = ДвоичныеДанныеПоСсылке(Выборка.Ссылка);
			ИмяФайла = ИмяВременногоКаталога + ПолучитьРазделительПути() + Выборка.Наименование;
			ДвоичныеДанные.Записать(ИмяФайла);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ДвоичныеДанныеПоСсылке(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Файлы.ДвоичныеДанные КАК ДвоичныеДанные
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|ГДЕ
		|	Файлы.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.ДвоичныеДанные.Получить();
	
КонецФункции

#КонецОбласти
